Revit 2027 API
BuiltInFailures.SketchFailures.LandingTwoManyLoops Property
 Sketch landing can only have one closed loop
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LandingTwoManyLoops { get; }
Public Shared ReadOnly Property LandingTwoManyLoops As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LandingTwoManyLoops {
	FailureDefinitionId^ get ();
}
static member LandingTwoManyLoops : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace